Revit 2024 API
BuiltInFailures.StairRampFailures.CannotCreateStairForLevelOverlapping Property
 Some of the multistory stairs couldn't be created due to the overlapped levels.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCreateStairForLevelOverlapping { get; }
Visual Basic
Public Shared ReadOnly Property CannotCreateStairForLevelOverlapping As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCreateStairForLevelOverlapping {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace